app/controllers/boats_controller.rb

SELECT "boats".* FROM "boats"
---
  def index
    puts "\n******** boats_index ********"
    @boats = Boat.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "ports".* FROM "ports"
---
  def new
    puts "\n******** boats_new ********"
    @boat = Boat.new
    @user = User.find(current_user.id)
    @ports = Port.all

INSERT INTO "boats" ("user_id", "port_id", "name", "amount_of_containers", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 1], ["port_id", 6], ["name", "Garen"], ["amount_of_containers", 22], ["created_at", "2017-07-13 18:14:23.671323"], ["updated_at", "2017-07-13 18:14:23.671323"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "ports".* FROM "ports"
---
  def create
    puts "\n******** boats_create ********"
    @boat = Boat.new(boat_params)
    puts "*** params.inspect: #{params.inspect} ***"

    respond_to do |format|
      if @boat.save
        format.html { redirect_to user_boats_path(current_user), notice: 'Boat was successfully created.' }
        format.json { render :show, status: :created, location: @boat }
      else
        @user = User.find(current_user.id)
        @ports = Port.all