app/controllers/comments_controller.rb

INSERT INTO "comments" ("user_id", "job_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["job_id", 1], ["content", "we got it"], ["created_at", "2017-07-13 20:32:35.982637"], ["updated_at", "2017-07-13 20:32:35.982637"]]
---
  def create
    puts "\n******** comments_create ********"
    @comment = Comment.new(comment_params)
    @user = User.all

    respond_to do |format|
      if @comment.save