app/controllers/jobs_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    puts "\n******** job_index ********"
    @jobs = Job.all
    @user = User.find(current_user.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    puts "\n******** job_show ********"
    puts "*** params.inspect: #{params.inspect} ***"
    @user = User.find(current_user.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "ports".* FROM "ports"
SELECT "boats".* FROM "boats"
---
  def new
    puts "\n******** job_new ********"
    @user = User.find(current_user.id)
    @ports = Port.all
    @boats = Boat.all

INSERT INTO "boat_jobs" ("boat_id", "job_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["boat_id", 1], ["job_id", 6], ["created_at", "2017-07-14 21:42:17.025040"], ["updated_at", "2017-07-14 21:42:17.025040"]]
SELECT  "boats".* FROM "boats" WHERE "boats"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "ports".* FROM "ports"
---
    def create
      puts "\n******** job_create ********"
      puts "*** @boat.inspect: #{@boat.inspect} ***"
      @job = Job.new(job_params)
      if @job.save
        @job.boats << Boat.find(params[:boat_id])
        redirect_to user_jobs_path(current_user.id)
      else
        @user = User.find(current_user.id)
        @ports = Port.all