app/controllers/users_controller.rb

  def feed
    puts "\n******** feed ********"
    @user = User.find(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]